package com.javarush.test.level05.lesson12.home04;
/*
import java.util.*;
import java.text.DateFormat;
import java.text.SimpleDateFormat;*/
/* Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 02 2014".
*/

public class Solution
{
    public static void main(String[] args)
    {
        //Напишите тут ваш код
/*        DateFormat dateFormat = new SimpleDateFormat("dd MM yyyy");
        Date date = new Date();
        System.out.println(dateFormat.format(date));*/
        System.out.println("20 10 2014");
    }
}
